from django.db import models


class Lines(models.Model):
    name = models.CharField(max_length=20)


class MetroMap(models.Model):
    row = [0] * 4  # создаем список-строку длиной M ['название', номер линии, top, left]
    mapData = [row] * 72  # создаем массив (список) из N строк

    mapData[0] = ['Парнас', 2, 20, 40]
    mapData[1] = ['Проспект Просвещения', 2, 24, 40]
    mapData[2] = ['Озерки', 2, 28, 40]
    mapData[3] = ['Удельная', 2, 32, 40]
    mapData[4] = ['Пионерская', 2, 36, 40]
    mapData[5] = ['Чёрная Речка', 2, 40, 40]
    mapData[6] = ['Петроградская', 2, 44, 40]
    mapData[7] = ['Горьковская', 2, 48, 40]
    mapData[8] = ['Невский Проспект', 2, 52, 40]
    mapData[9] = ['Сенная Площадь', 2, 56, 40]
    mapData[10] = ['Технологический Институт - 2', 2, 60, 40]
    mapData[11] = ['Фрунзенская', 2, 64, 40]
    mapData[12] = ['Московские Ворота', 2, 68, 40]
    mapData[13] = ['Электросила', 2, 72, 40]
    mapData[14] = ['Парк Победы', 2, 76, 40]
    mapData[15] = ['Московская', 2, 80, 40]
    mapData[16] = ['Звёздная', 2, 84, 40]
    mapData[17] = ['Купчино', 2, 88, 40]

    mapData[18] = ['Девяткино', 1, 16, 60]
    mapData[19] = ['Гражданский Проспект', 1, 20, 60]
    mapData[20] = ['Академическая', 1, 24, 60]
    mapData[21] = ['Политехническая', 1, 28, 60]
    mapData[22] = ['Площадь Мужества', 1, 32, 60]
    mapData[23] = ['Лесная', 1, 36, 60]
    mapData[24] = ['Выборгская', 1, 40, 60]
    mapData[25] = ['Площадь Ленина', 1, 44, 60]
    mapData[26] = ['Чернышевская', 1, 48, 60]
    mapData[27] = ['Площадь Восстания', 1, 52, 60]
    mapData[28] = ['Владимирская', 1, 56, 60]
    mapData[29] = ['Пушкинская', 1, 60, 60]
